spec/fixtures/api/invoice_collection_index.json

{
  "invoice_collections": [
    {
      "month": "2023-11-01T00:00:00.000Z",
      "payment_status": "pending",
      "invoices_count": 10,
      "amount_cents": 100,
      "currency": "EUR"
    },
    {
      "month": "2023-12-01T00:00:00.000Z",
      "payment_status": "pending",
      "invoices_count": 7,
      "amount_cents": 200,
      "currency": "USD"
    }
  ]
}
